IRP/src/Documents/RetailSalesReceipt/RetailSalesReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>RetailSalesReceipt</name>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.R2005T_SalesSpecialOffers</registerRecords>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
 <registerRecords>InformationRegister.T3010S_RowIDInfo</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>AccumulationRegister.R2050T_RetailSales</registerRecords>
 <registerRecords>AccumulationRegister.R3050T_PosCashBalances</registerRecords>
 <registerRecords>AccumulationRegister.R2001T_Sales</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>AccumulationRegister.R3010B_CashOnHand</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.TM1010T_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R4014B_SerialLotNumber</registerRecords>
 <registerRecords>AccumulationRegister.R8013B_ConsignorBatchWiseBalance</registerRecords>
 <registerRecords>AccumulationRegister.R8014T_ConsignorSales</registerRecords>
 <registerRecords>AccumulationRegister.R8012B_ConsignorInventory</registerRecords>
 <registerRecords>AccumulationRegister.R9010B_SourceOfOriginStock</registerRecords>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>AccumulationRegister.R2023B_AdvancesFromRetailCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>BasisDocument</name>
  <type>
   <types>DefinedType.typeBasisDocumentSalesInvoice</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>DateOfShipment</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Manager</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>RetailCustomer</name>
  <type>
   <types>CatalogRef.RetailCustomers</types>
  </type>
 </attributes>
 <attributes>
  <name>UsePartnerTransactions</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalNameContract</name>
  <type>
   <types>CatalogRef.LegalNameContracts</types>
  </type>
 </attributes>
 <attributes>
  <name>ConsolidatedRetailSales</name>
  <type>
   <types>DocumentRef.ConsolidatedRetailSales</types>
  </type>
 </attributes>
 <attributes>
  <name>Workstation</name>
  <type>
   <types>CatalogRef.Workstations</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentMethod</name>
  <type>
   <types>EnumRef.ReceiptPaymentMethods</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>TotalAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>OffersAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>PriceType</name>
   <type>
    <types>CatalogRef.PriceTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Detail</name>
   <type>
    <types>DefinedType.typeDescription</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>DontCalculateRow</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesPerson</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>UseSerialLotNumber</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>InventoryOrigin</name>
   <type>
    <types>EnumRef.InventoryOrigingTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesOrder</name>
   <type>
    <types>DocumentRef.SalesOrder</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecialOffers</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Offer</name>
   <type>
    <types>CatalogRef.SpecialOffers</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>Analytics</name>
   <type>
    <types>CatalogRef.TaxAnalytics</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IncludeToTotalAmount</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ManualAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Payments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentType</name>
   <type>
    <types>CatalogRef.PaymentTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentTerminal</name>
   <type>
    <types>CatalogRef.PaymentTerminals</types>
   </type>
  </attributes>
  <attributes>
   <name>Account</name>
   <type>
    <types>CatalogRef.CashAccounts</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>Commission</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>BankTerm</name>
   <type>
    <types>CatalogRef.BankTerms</types>
   </type>
  </attributes>
  <attributes>
   <name>RRNCode</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>30</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaymentInfo</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SerialLotNumbers</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RowIDInfo</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrentStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>NextStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>RowRef</name>
   <type>
    <types>CatalogRef.RowIDs</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AccountingRowAnalytics</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Operation</name>
   <type>
    <types>CatalogRef.AccountingOperations</types>
   </type>
  </attributes>
  <attributes>
   <name>LedgerType</name>
   <type>
    <types>CatalogRef.LedgerTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountDebit</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountCredit</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AccountingExtDimensions</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Operation</name>
   <type>
    <types>CatalogRef.AccountingOperations</types>
   </type>
  </attributes>
  <attributes>
   <name>LedgerType</name>
   <type>
    <types>CatalogRef.LedgerTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AnalyticType</name>
   <type>
    <types>EnumRef.AccountingAnalyticTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimension</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorBatches</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>SourceOfOrigin</name>
   <type>
    <types>CatalogRef.SourceOfOrigins</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Batch</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
    <types>DocumentRef.OpeningEntry</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SourceOfOrigins</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>SourceOfOrigin</name>
   <type>
    <types>CatalogRef.SourceOfOrigins</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/RetailSalesReceipt/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;

	Payments_Amount = ThisObject.Payments.Total("Amount");
	ItemList_Amount = ThisObject.ItemList.Total("TotalAmount");
	If ItemList_Amount <> Payments_Amount Then
		Cancel = True;
		CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_095, Payments_Amount, ItemList_Amount));
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	Parameters = CurrenciesClientServer.GetParameters_V3(ThisObject);
	CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies);
	CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);

	If FOServer.IsUseAccounting() And WriteMode = DocumentWriteMode.Posting Then
		AccountingClientServer.UpdateAccountingTables(ThisObject, "ItemList");
	EndIf;

	ThisObject.DocumentAmount = ThisObject.ItemList.Total("TotalAmount");
	
	ValuesBeforeWrite = New Structure();
	ValuesBeforeWrite.Insert("Posted", ThisObject.Ref.Posted);
	ValuesBeforeWrite.Insert("DeletionMark", ThisObject.Ref.DeletionMark);
	
	ThisObject.AdditionalProperties.Insert("ValuesBeforeWrite", ValuesBeforeWrite);
	ThisObject.AdditionalProperties.Insert("OriginalDocumentDate", PostingServer.GetOriginalDocumentDate(ThisObject));
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If DocConsolidatedRetailSalesServer.IsClosedRetailDocument(ThisObject.Ref) Then
		ValuesBeforeWrite = ThisObject.AdditionalProperties.ValuesBeforeWrite;
		IsDeletionMark = ThisObject.DeletionMark <> ValuesBeforeWrite.DeletionMark;
		IsUnposting = Not ThisObject.Ref.Posted And ValuesBeforeWrite.Posted;
		
		If IsDeletionMark Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_118, ThisObject.ConsolidatedRetailSales));
		ElsIf IsUnposting Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_116, ThisObject.ConsolidatedRetailSales));
		EndIf;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") And FillingData.Property("BasedOn") Then
		PropertiesHeader = RowIDInfoServer.GetSeparatorColumns(ThisObject.Metadata());
		FillPropertyValues(ThisObject, FillingData, PropertiesHeader);
		LinkedResult = RowIDInfoServer.AddLinkedDocumentRows(ThisObject, FillingData);
		ControllerClientServer_V2.SetReadOnlyProperties_RowID(ThisObject, PropertiesHeader, LinkedResult.UpdatedProperties);
	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	LinkedTables = New Array();
	LinkedTables.Add(SpecialOffers);
	LinkedTables.Add(TaxList);
	LinkedTables.Add(Currencies);
	LinkedTables.Add(SerialLotNumbers);
	DocumentsServer.SetNewTableUUID(ItemList, LinkedTables);
	
	For Each Row In Payments Do
		Row.RRNCode = "";
		Row.PaymentInfo = "";
	EndDo;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DocumentsServer.CheckItemListStores(ThisObject) Then
		Cancel = True;
	EndIf;

	If Not SerialLotNumbersServer.CheckFilling(ThisObject) Then
		Cancel = True;
	EndIf;
	
	If DocConsolidatedRetailSalesServer.UseConsolidatedRetailSales(ThisObject.Branch) 
		And Not ValueIsFilled(ThisObject.ConsolidatedRetailSales) Then
		Cancel = True;
		FieldName = ThisObject.Metadata().Attributes.ConsolidatedRetailSales.Synonym;
		CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_047, FieldName), "ConsolidatedRetailSales", ThisObject);
	EndIf;

	If ValueIsFilled(ThisObject.Company) Then
		Query = New Query;
		Query.Text =
		"SELECT
		|	ItemList.LineNumber AS LineNumber,
		|	ItemList.Key AS Key,
		|	CAST(ItemList.Store AS Catalog.Stores) AS Store
		|into ttItemList
		|FROM
		|	&ItemList AS ItemList
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	RowIDInfo.Key AS Key,
		|	RowIDInfo.Basis AS Basis
		|into ttRowIDInfo
		|FROM
		|	&RowIDInfo AS RowIDInfo
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ItemList.LineNumber AS LineNumber,
		|	ItemList.Store AS Store,
		|	ItemList.Store.Company AS StoreCompany,
		|	RowIDInfo.Basis AS Basis
		|FROM
		|	ttItemList AS ItemList
		|		LEFT JOIN ttRowIDInfo AS RowIDInfo
		|		ON ItemList.Key = RowIDInfo.Key
		|
		|ORDER BY
		|	LineNumber";
		Query.SetParameter("ItemList", ThisObject.ItemList.Unload());
		Query.SetParameter("RowIDInfo", ThisObject.RowIDInfo.Unload());
		QuerySelection = Query.Execute().Select();
		While QuerySelection.Next() Do
			If ValueIsFilled(QuerySelection.Basis) Then
				Continue;
			ElsIf ValueIsFilled(QuerySelection.StoreCompany) And Not QuerySelection.StoreCompany = ThisObject.Company Then
				Cancel = True;
				MessageText = StrTemplate(
					R().Error_Store_Company_Row,
					QuerySelection.Store,
					ThisObject.Company, 
					QuerySelection.LineNumber);
				CommonFunctionsClientServer.ShowUsersMessage(
					MessageText, 
					"Object.ItemList[" + (QuerySelection.LineNumber - 1) + "].Store", 
					"Object.ItemList");
			EndIf;
		EndDo;
	EndIf;
EndProcedure
